-----CONFIGURACION BASICA DE LA CLI---------

router , switch capa 3

MODO PRIVILEGIADO
enable
#
nota: si se pone una keyword incompleta al presionar \t [tab] se completara
nota1: si no se sabe que se puede anidar a esa keyword completamos con ? y se mostrara la informacion

//mirar la informacion de configuracion
#show version

//pasamos de modo # a modo config
#conf\t 
#configure ?
	terminal
#configure ter\t
#configure terminal

Switch(config) interface ?
//elegimos una de la informacion mostrada y completamos los parametros segun "?"

//poner nombre al equipo
//seguimos en modo config
Switch(config)#hostname NOMBRE_DEL_SWITCH
//si al acceder al equipo se quiere mostrar ciertas politicas o algun mensaje
Switch(config)#banner motd "MENSAJE A MOSTRAR"

//salir del modo config
end
//entramos a modo config
enable
#configure terminal
//ponemos contraseña
NOMBRE_DEL_SWITCH(config)#enable secret CONTRASEÑA
NOMBRE_DEL_SWITCH(config)#line console 0
NOMBRE_DEL_SWITCH(config)#password CONTRASEÑA
NOMBRE_DEL_SWITCH(config)#login
NOMBRE_DEL_SWITCH(config)#exec-timeout 20
NOMBRE_DEL_SWITCH(config)#loggin syn\t
NOMBRE_DEL_SWITCH(config)#exit

//en modo privilegiado
NOMBRE_DEL_SWITCH#show running-config
---se muestra toda la informacion----
//nota: se muestra inclusive la contraseña , es decir si alguien llega
//a entrar al equipo esto tambien es visible para el

//Encriptar contraseña
//en modo config
NOMBRE_DEL_SWITCH(config)#service pas\t
NOMBRE_DEL_SWITCH(config)#exit
//nuevamente entramos desde modo privilegiado y usamos el show, veremos que ahora esta encriptado

//Configuracion de la Hora
//modo privilegiado
NOMBRE_DEL_SWITCH#clock set 10:44:00 02 january 2024
//vemos la hora
NOMBRE_DEL_SWITCH# show clock
//10:44:00 02 january 2024

//guardamos toda la informacion pues solo esta ,esta guardada en la memoria RAM
//en modo privilegiado
NOMBRE_DEL_SWITCH#wr






